-- phpMyAdmin SQL Dump
-- version 4.4.14.1
-- http://www.phpmyadmin.net
--
-- Host: localhost
-- Generation Time: Oct 09, 2016 at 06:41 AM
-- Server version: 5.6.25
-- PHP Version: 5.5.36

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `dental`
--

-- --------------------------------------------------------

--
-- Table structure for table `tb_history_patient`
--

CREATE TABLE IF NOT EXISTS `tb_history_patient` (
  `id_history_patient` int(11) NOT NULL,
  `HN` varchar(20) NOT NULL,
  `DN` varchar(20) NOT NULL,
  `othnumber` varchar(20) NOT NULL,
  `CN` varchar(20) NOT NULL,
  `seriesnumber` varchar(20) NOT NULL,
  `firstname` varchar(35) NOT NULL,
  `lastname` varchar(50) NOT NULL,
  `filename` varchar(50) NOT NULL,
  `birthdate` date NOT NULL,
  `address` text NOT NULL,
  `nationality` varchar(50) NOT NULL,
  `race` varchar(30) NOT NULL,
  `religion` varchar(50) NOT NULL,
  `namefather` varchar(35) NOT NULL,
  `fatherlastname` varchar(50) NOT NULL,
  `career` varchar(50) NOT NULL,
  `birthdatefahter` date NOT NULL,
  `age1` float NOT NULL,
  `disease` varchar(50) NOT NULL,
  `mothername` varchar(50) NOT NULL,
  `motherlastname` varchar(50) NOT NULL,
  `mothercareer` varchar(50) NOT NULL,
  `birthdatemother` date NOT NULL,
  `age2` int(11) NOT NULL,
  `diseasemother` varchar(50) NOT NULL,
  `spousename` varchar(50) NOT NULL,
  `spouselastname` varchar(50) NOT NULL,
  `benefits` int(5) NOT NULL,
  `otherbenefits` varchar(50) NOT NULL,
  `numberbenefits` varchar(20) NOT NULL,
  `evertreat` varchar(20) NOT NULL,
  `otherevertreat` int(5) NOT NULL,
  `treatmentfacility` varchar(60) NOT NULL,
  `doctor` varchar(100) NOT NULL,
  `developmentallevel` int(10) NOT NULL,
  `otherdevelopmentallevel` text NOT NULL,
  `daterecord` date NOT NULL,
  `id_user` int(5) NOT NULL,
  `sex` int(2) NOT NULL,
  `tel` text NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=41 DEFAULT CHARSET=utf8;

--
-- Dumping data for table `tb_history_patient`
--

INSERT INTO `tb_history_patient` (`id_history_patient`, `HN`, `DN`, `othnumber`, `CN`, `seriesnumber`, `firstname`, `lastname`, `filename`, `birthdate`, `address`, `nationality`, `race`, `religion`, `namefather`, `fatherlastname`, `career`, `birthdatefahter`, `age1`, `disease`, `mothername`, `motherlastname`, `mothercareer`, `birthdatemother`, `age2`, `diseasemother`, `spousename`, `spouselastname`, `benefits`, `otherbenefits`, `numberbenefits`, `evertreat`, `otherevertreat`, `treatmentfacility`, `doctor`, `developmentallevel`, `otherdevelopmentallevel`, `daterecord`, `id_user`, `sex`, `tel`) VALUES
(23, '2607', '511505', 'c24/51', 'D10200800637', '1409900916411', 'ปณิตา', 'คำอ้อ', '', '0000-00-00', '48 หมู่3 ต.หนองกุง อ.น้ำพอง จ.ขอนแก่น 40140', 'ไทย', 'ไทย', 'พุทธ', 'พงษ์ศักดิ์', 'คำอ้อ', 'ก่อสร้าง', '0000-00-00', 0, '', 'ศรีวิไล', 'คำอ้อ', 'ทำนา', '0000-00-00', 0, '', '', '', 2, '', 'ท8248520060', '2', 0, '', '', 1, '', '2016-09-25', 0, 2, '0981036646'),
(24, '', '584771', 'c61/58', 'D10201506481', '1459200101598', 'กานต์ธิดา', 'ยอดยิ่ง', '', '2015-05-15', '3 หมู่2 ต.โพธิ์ใหญ่ อ.พนมไพร จ.ร้อยเอ็ด', 'ไทย', 'ไทย', 'พุทธ', 'บุรินทร์', 'ยอดยิ่ง', '', '0000-00-00', 0, '', 'สุริยา', 'นันทะมา', '', '0000-00-00', 0, '', '', '', 2, '', 'R714500281542', '2', 0, '', '', 1, '', '2016-09-25', 0, 2, '0806057249'),
(25, '', '536072', 'c9/54', 'D10201102413', '1451100221642', 'มุกดารัตน์', 'สัตตัง', '', '1994-08-18', '116/2 ต.ทุ่งศรีเมือง อ.สุวรรณภูมิ จ.ร้อยเอ็ด 45130', 'ไทย', 'ไทย', 'พุทธ', 'ถนอม (เสียชีวิต)', 'สัตตัง', '', '0000-00-00', 0, '', 'วงเดือน', 'สัตตัง', 'ทำนา', '0000-00-00', 0, '', '', '', 2, '', 'ท7349887123', '2', 0, '', '', 1, '', '2016-09-25', 0, 2, '0880607803'),
(26, '', '455578', 'c88/45', '', '1469900321418', 'แทนไท', 'ภูเป่งน้ำ', '', '1995-11-14', '183 หมู่6 ต.หัวงัว อ.ยางตลาด จ.กาฬสินธุ์ 46120', 'ไทย', 'ไทย', 'พุทธ', 'ภูชะนะ', 'ภูเป่งน้ำ', '', '0000-00-00', 0, '', 'จิระภา', 'ภูเป่งน้ำ', '', '0000-00-00', 0, '', '', '', 2, '', 'ท7351444516', '3', 0, '', '', 1, '', '2016-09-25', 0, 1, '0835617781'),
(28, '', '486284', 'c18/49', 'D10200900558', '1410400279121', 'ธิดาเทพ', 'แสนสง่า', '', '1994-12-05', '60 หมู่3 ต.ตาดทอง อ.ศรีธาตุ จ.อุดรธานี 41230', 'ไทย', 'ไทย', 'พุทธ', 'กฤษฎา', 'แสนสง่า', '', '0000-00-00', 0, '', 'มธุรดา', 'สีแสง', '', '0000-00-00', 0, '', '', '', 1, '', '', '3', 0, '', '', 1, '', '2016-09-25', 0, 2, '0846848323'),
(29, 'IK1888', '563005', 'c34/56', '', '1470801479387', 'มิณณพัฒน์', 'วิชาโคตร', '', '2013-04-21', '85 หมู่17 ต.ธาตุ อ.วานรนิวาส จ.สกลนคร 47120', 'ไทย', 'ไทย', 'พุทธ', 'ณัฐพร', 'วิชาโคตร', 'รับจ้าง/นักศึกษา', '0000-00-00', 0, '', 'จิตรพร', 'ต้นพรม', 'รับจ้าง/นักศึกษา', '0000-00-00', 0, '', '', '', 5, 'สิทธิ์ว่าง', '', '2', 0, '', '', 1, '', '2016-09-26', 0, 2, '0899014936'),
(30, '', '437079', 'c1/36', 'D10-2008-00791', '1409900981728', 'มณฑนา', 'ชุติมารังสรรค์', '', '1992-12-30', '388/1 หมู่5 ต.โนนสะอาด อ.ชุมแพ จ.ขอนแก่น 40290', 'ไทย', 'ไทย', 'พุทธ', 'เกษม', 'ชุติมารังสรรค์', 'ค้าขาย', '0000-00-00', 0, '', 'ลำไพร', 'ชุติมารังสรรค์', 'แม่บ้าน', '0000-00-00', 0, '', '', '', 2, '', '', '2', 0, '', '', 1, '', '2016-09-26', 0, 2, '0872137764'),
(31, '', '584558', 'c50/58', 'D10-2015-06508', '1409904423088', 'ณนษภัทร', 'กองกะมุด', '', '2015-06-15', '588/91 หมู่บ้านชลพฤกษ์พาร์ควิลล์ ต.เมืองเก่า อ.เมือง จ.ขอนแก่น 40000', 'ไทย', 'ไทย', 'พุทธ', 'รุจิภาส', 'กองกะมุด', 'ธุรกิจส่วนตัว', '0000-00-00', 0, '', 'ยศวันต์', 'กองกะมุด', 'แม่บ้าน', '0000-00-00', 0, '', '', '', 2, '', '', '2', 0, '', '', 1, '', '2016-09-26', 0, 1, '0924766821'),
(32, '', '', '', '', '3409900637209', 'รวิศุทธ์', 'อำไพกรองกาญจน์', '', '2015-06-15', '588/91 หมู่บ้านชลพฤกษ์พาร์ควิลล์ ต.เมืองเก่า อ.เมือง จ.ขอนแก่น 40000', 'ไทย', 'ไทย', 'พุทธ', 'รุจิภาส', 'กองกะมุด', 'ธุรกิจส่วนตัว', '0000-00-00', 0, '', 'ยศวันต์', 'กองกะมุด', 'แม่บ้าน', '0000-00-00', 0, '', '', '', 2, '', '', '2', 0, '', '', 1, '', '2016-09-26', 0, 1, '0924766821'),
(33, 'cw6863', '432074', 'c14/43', 'D10-2008-01337', '3409900637209', 'ธนาภรณ์', 'กลายกลาง', '', '1996-08-17', '22 หมู่ 14 อ.เฉลิมพระเกียรติ จ.นครราชสีมา  30000', 'ไทย', 'ไทย', 'พุทธ', 'บุญส่ง', 'กลายกลาง', 'รับราชการ', '0000-00-00', 0, '', 'พิรุณ', 'กลายกลาง', 'รับราชการ', '0000-00-00', 0, '', '', '', 3, '', '', '3', 0, 'รพ.มหาราช นครราชสีมา', '', 1, '', '2016-09-26', 0, 2, '0887278292'),
(34, 'FG4274', '443682', 'c44/44', 'D10-2008-01387', '1429900406839', 'ศิรวุฒิ', 'อยู่ภักดี', '', '2001-07-05', '49/117 หมู่5 ต.หนองบัว อ.เมือง จ.อุดรธานี 42000', 'ไทย', 'ไทย', 'พุทธ', 'พต.พงศ์พิบูล', 'อยู่ภักดี', 'รับราชการ', '0000-00-00', 0, '', 'ธันวะดี', 'อยู่ภักดี', '', '0000-00-00', 0, '', '', '', 2, '', '', '3', 0, '', '', 1, '', '2016-09-26', 0, 1, '0814713424'),
(35, 'HG3004', '520928', 'c8/52', 'D10-2009-00391', '1419901931988', 'สุปัญญา', 'บุสุวะ', '', '2000-07-07', '8/1 หมู่5 ต.หนองขอนกว้าง อ.เมือง จ.อุดรธานี 41000', 'ไทย', 'ไทย', 'พุทธ', 'พรชัย', 'บุสุวะ', 'เกษตรกรรม', '0000-00-00', 0, '', 'วาสนา', 'บุสุวะ', 'ทำนา/ค้าขาย', '0000-00-00', 0, 'โลหิตจาง', '', '', 2, '', 'ท0026830477', '3', 0, 'รพ.อุดรธานี', 'ทพญ.วรางคณา หลักคำ', 1, '', '2016-09-26', 0, 1, '0835999120'),
(36, 'FM4565', '455114', 'c84/45', '', '1409903148610', 'ปณกานต์', 'คำภาเกะ', '', '2002-09-17', '3/9 ต.เมืองพล อ.พล จ.ขอนแก่น 40120', 'ไทย', 'ไทย', 'พุทธ', 'พิชิต', 'คำภาเกะ', 'รับราชการ', '0000-00-00', 0, '', 'กาญจนา', 'คำภาเกะ', 'รับราชการ', '0000-00-00', 0, '', '', '', 1, '', '', '2', 0, '', '', 1, '', '2016-09-26', 0, 0, ''),
(37, 'GH2455', '513094', 'c29/51', 'D10-2008-00213', '1311901035625', 'ดารกา', 'แวทไธสง', '', '2004-12-01', '31/1 หมู่6 ต.ทองหลาง อ.บ้านใหม่ไชยพจน์ จ.บุรีรัมย์ 31120', 'ไทย', 'ไทย', 'พุทธ', 'อภิวัฒน์', 'แวทไธสง', 'ทำนา', '0000-00-00', 0, '', 'ทองม้วน', 'แวทไธสง', 'ทำนา', '0000-00-00', 0, 'พาหะ Thalassemia', '', '', 2, '', 'ท7120543907', '3', 0, 'รพ.บุรีรัมย์,รพ.ศรีนครินทร์', '', 1, '', '2016-09-26', 0, 0, '0871046836'),
(38, 'EW3887', '436020', 'c39/43', '', '1420200070163', 'กาญจนา', 'ศรีเลิศ', '', '1999-07-08', '338 หมู่15 ต.นาดอกคำ อ.นาด้วง จ.เลย 42210', 'ไทย', 'ไทย', 'พุทธ', 'กาญน์', 'ศรีลิศ', '', '1964-04-10', 52, '', 'บาหยัน', 'ศรีเลิศ', '', '0000-00-00', 0, '', '', '', 2, '', 'ท0000035499', '1', 0, '', '', 1, '', '2016-09-26', 0, 0, '0933763991'),
(39, 'IF3673', '55558', 'c46/55', 'D10-2013-04335', '1100700966886', 'ขวัญจุฬา', 'จันโคตร', '', '1989-04-03', '18 ถ.พิทักษ์สันติราษฎร ต.ศรีบุญเรือง อ.เมือง จ.มุกดาหาร 49000', 'ไทย', 'ไทย', 'พุทธ', 'ชูชาติ', 'กัทลี', '', '0000-00-00', 0, '', 'พูนสิน', 'จันโคตร', '', '0000-00-00', 0, '', '', '', 1, '', '11472', '3', 0, 'รพ.สรรพสิทธิ์ประสงค์ จ.อุบลราชธานี', '', 1, '', '2016-09-26', 0, 0, '0801907129'),
(40, 'FI4437', '470813', 'c76/45', 'D10-2007-10874', '1103100480977', 'สุมาลี', 'อามาตมุลตรี', '', '1997-04-28', '54 หมู่14 ต.จังหาร อ.จังหาร จ.ร้อยเอ็ด 45000', 'ไทย', 'ไทย', 'พุทธ', 'ทองดี', 'อามาตมุลตรี', 'ทำนา', '0000-00-00', 0, '', 'หนูเพียร', 'อามาตมุลตรี', 'ทำนา', '0000-00-00', 0, '', '', '', 2, '', '', '3', 0, 'รพ.เจริญกรุง,รพ.ศรีนครินทร์', '', 1, '', '2016-09-26', 0, 0, '0850589872');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `tb_history_patient`
--
ALTER TABLE `tb_history_patient`
  ADD PRIMARY KEY (`id_history_patient`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `tb_history_patient`
--
ALTER TABLE `tb_history_patient`
  MODIFY `id_history_patient` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=41;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
